# ParameterId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..ParameterId Property
ScheduleField Class See Also
---
The ID of the parameter displayed by the field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId ParameterId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ParameterId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ParameterId {
	ElementId^ get ();
}
```

# Remarks
Most field types require a parameter ID. Count, Formula, and Percentage fields don't have parameter IDs.
# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace